{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "6cdd499b-31a5-4414-97ad-b5fdb2dddab8",
   "metadata": {},
   "outputs": [],
   "source": [
    "# pip install -r ../requirements.txt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "9765259b-80c6-4520-aac8-617704b1bf43",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/opt/Anaconda/anaconda3/envs/ucsd1/lib/python3.8/site-packages/tqdm/auto.py:22: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html\n",
      "  from .autonotebook import tqdm as notebook_tqdm\n",
      "/opt/Anaconda/anaconda3/envs/ucsd1/lib/python3.8/site-packages/past/builtins/misc.py:45: DeprecationWarning: the imp module is deprecated in favour of importlib; see the module's documentation for alternative uses\n",
      "  from imp import reload\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=======\n",
      "{\n",
      "    \"crawler\": {\n",
      "        \"on\": true\n",
      "    },\n",
      "    \"extract\": {\n",
      "        \"awards_nominated\": {\n",
      "            \"filepath_or_buffer\": \"files/archive/award_nominated.csv\",\n",
      "            \"sep\": \",\"\n",
      "        },\n",
      "        \"awards_won\": {\n",
      "            \"filepath_or_buffer\": \"files/archive/award_won.csv\",\n",
      "            \"sep\": \",\"\n",
      "        },\n",
      "        \"cast\": {\n",
      "            \"filepath_or_buffer\": \"files/archive/AllMoviesCastingRaw.csv\",\n",
      "            \"sep\": \";\"\n",
      "        },\n",
      "        \"directors\": {\n",
      "            \"filepath_or_buffer\": \"files/archive/900_acclaimed_directors_awards.csv\",\n",
      "            \"sep\": \";\"\n",
      "        },\n",
      "        \"movies\": {\n",
      "            \"filepath_or_buffer\": \"files/archive/AllMoviesDetailsCleaned.csv\",\n",
      "            \"sep\": \";\"\n",
      "        },\n",
      "        \"topics\": {\n",
      "            \"filepath_or_buffer\": \"files/archive/topic_words.csv\",\n",
      "            \"sep\": \",\"\n",
      "        },\n",
      "        \"topics_movies\": {\n",
      "            \"filepath_or_buffer\": \"files/archive/movie_topic_ids.csv\",\n",
      "            \"sep\": \",\"\n",
      "        }\n",
      "    },\n",
      "    \"load\": {\n",
      "        \"constraints\": [\n",
      "            {\n",
      "                \"field\": \"id\",\n",
      "                \"name\": \"Topics\",\n",
      "                \"node_name\": \"Topic\"\n",
      "            },\n",
      "            {\n",
      "                \"field\": \"award_id\",\n",
      "                \"name\": \"Awards\",\n",
      "                \"node_name\": \"Award\"\n",
      "            },\n",
      "            {\n",
      "                \"field\": \"name\",\n",
      "                \"name\": \"Companies\",\n",
      "                \"node_name\": \"Company\"\n",
      "            },\n",
      "            {\n",
      "                \"field\": \"name\",\n",
      "                \"name\": \"Genres\",\n",
      "                \"node_name\": \"Genre\"\n",
      "            },\n",
      "            {\n",
      "                \"field\": \"name\",\n",
      "                \"name\": \"People\",\n",
      "                \"node_name\": \"Person\"\n",
      "            },\n",
      "            {\n",
      "                \"field\": \"movie_id\",\n",
      "                \"name\": \"Movies\",\n",
      "                \"node_name\": \"Movie\"\n",
      "            }\n",
      "        ],\n",
      "        \"data\": {\n",
      "            \"awards\": [\n",
      "                {\n",
      "                    \"cols\": [\n",
      "                        \"award_id\",\n",
      "                        \"award_company\",\n",
      "                        \"award_type\",\n",
      "                        \"year\"\n",
      "                    ],\n",
      "                    \"node_name\": \"Award\",\n",
      "                    \"ref\": \"aw\"\n",
      "                }\n",
      "            ],\n",
      "            \"company\": [\n",
      "                {\n",
      "                    \"cols\": [\n",
      "                        \"name\"\n",
      "                    ],\n",
      "                    \"node_name\": \"Company\",\n",
      "                    \"ref\": \"c\"\n",
      "                }\n",
      "            ],\n",
      "            \"genres\": [\n",
      "                {\n",
      "                    \"cols\": [\n",
      "                        \"name\"\n",
      "                    ],\n",
      "                    \"node_name\": \"Genre\",\n",
      "                    \"ref\": \"g\"\n",
      "                }\n",
      "            ],\n",
      "            \"movies\": [\n",
      "                {\n",
      "                    \"cols\": [\n",
      "                        \"movie_id\",\n",
      "                        \"imdb_id\",\n",
      "                        \"lang\",\n",
      "                        \"title\",\n",
      "                        \"overview\"\n",
      "                    ],\n",
      "                    \"node_name\": \"Movie\",\n",
      "                    \"ref\": \"m\"\n",
      "                },\n",
      "                {\n",
      "                    \"cols\": [\n",
      "                        \"name\"\n",
      "                    ],\n",
      "                    \"needs\": \"m\",\n",
      "                    \"node_name\": \"Person\",\n",
      "                    \"ref\": \"d\",\n",
      "                    \"relations\": [\n",
      "                        {\n",
      "                            \"begins\": \"d\",\n",
      "                            \"begins_dir\": \"-\",\n",
      "                            \"ends\": \"m\",\n",
      "                            \"ends_dir\": \"->\",\n",
      "                            \"name\": \"DIRECTED\"\n",
      "                        }\n",
      "                    ],\n",
      "                    \"unwind\": \"directors\"\n",
      "                },\n",
      "                {\n",
      "                    \"cols\": [\n",
      "                        \"name\"\n",
      "                    ],\n",
      "                    \"needs\": \"m\",\n",
      "                    \"node_name\": \"Company\",\n",
      "                    \"ref\": \"c\",\n",
      "                    \"relations\": [\n",
      "                        {\n",
      "                            \"begins\": \"c\",\n",
      "                            \"begins_dir\": \"-\",\n",
      "                            \"ends\": \"m\",\n",
      "                            \"ends_dir\": \"->\",\n",
      "                            \"name\": \"PRODUCED\"\n",
      "                        }\n",
      "                    ],\n",
      "                    \"unwind\": \"companies\"\n",
      "                },\n",
      "                {\n",
      "                    \"cols\": [\n",
      "                        \"name\"\n",
      "                    ],\n",
      "                    \"needs\": \"m\",\n",
      "                    \"node_name\": \"Genre\",\n",
      "                    \"ref\": \"g\",\n",
      "                    \"relations\": [\n",
      "                        {\n",
      "                            \"begins\": \"m\",\n",
      "                            \"begins_dir\": \"-\",\n",
      "                            \"ends\": \"g\",\n",
      "                            \"ends_dir\": \"->\",\n",
      "                            \"name\": \"HAS_GENRE\"\n",
      "                        }\n",
      "                    ],\n",
      "                    \"unwind\": \"genres\"\n",
      "                },\n",
      "                {\n",
      "                    \"cols\": [\n",
      "                        \"name\"\n",
      "                    ],\n",
      "                    \"needs\": \"m\",\n",
      "                    \"node_name\": \"Person\",\n",
      "                    \"ref\": \"a\",\n",
      "                    \"relations\": [\n",
      "                        {\n",
      "                            \"begins\": \"a\",\n",
      "                            \"begins_dir\": \"-\",\n",
      "                            \"ends\": \"m\",\n",
      "                            \"ends_dir\": \"->\",\n",
      "                            \"name\": \"ACTED_IN\"\n",
      "                        }\n",
      "                    ],\n",
      "                    \"unwind\": \"actors\"\n",
      "                },\n",
      "                {\n",
      "                    \"cols\": [\n",
      "                        \"award_id\"\n",
      "                    ],\n",
      "                    \"needs\": \"m\",\n",
      "                    \"node_name\": \"Award\",\n",
      "                    \"ref\": \"aw\",\n",
      "                    \"relations\": [\n",
      "                        {\n",
      "                            \"begins\": \"m\",\n",
      "                            \"begins_dir\": \"-\",\n",
      "                            \"ends\": \"aw\",\n",
      "                            \"ends_dir\": \"->\",\n",
      "                            \"name\": \"WON\"\n",
      "                        },\n",
      "                        {\n",
      "                            \"begins\": \"m\",\n",
      "                            \"begins_dir\": \"-\",\n",
      "                            \"ends\": \"aw\",\n",
      "                            \"ends_dir\": \"->\",\n",
      "                            \"name\": \"NOMINATED\"\n",
      "                        }\n",
      "                    ],\n",
      "                    \"unwind\": \"awards_won\"\n",
      "                },\n",
      "                {\n",
      "                    \"cols\": [\n",
      "                        \"award_id\"\n",
      "                    ],\n",
      "                    \"needs\": \"m\",\n",
      "                    \"node_name\": \"Award\",\n",
      "                    \"ref\": \"an\",\n",
      "                    \"relations\": [\n",
      "                        {\n",
      "                            \"begins\": \"m\",\n",
      "                            \"begins_dir\": \"-\",\n",
      "                            \"ends\": \"an\",\n",
      "                            \"ends_dir\": \"->\",\n",
      "                            \"name\": \"NOMINATED\"\n",
      "                        }\n",
      "                    ],\n",
      "                    \"unwind\": \"awards_nominated\"\n",
      "                },\n",
      "                {\n",
      "                    \"cols\": [\n",
      "                        \"topic_id\"\n",
      "                    ],\n",
      "                    \"needs\": \"m\",\n",
      "                    \"node_name\": \"Topic\",\n",
      "                    \"ref\": \"t\",\n",
      "                    \"relations\": [\n",
      "                        {\n",
      "                            \"begins\": \"m\",\n",
      "                            \"begins_dir\": \"-\",\n",
      "                            \"ends\": \"t\",\n",
      "                            \"ends_dir\": \"->\",\n",
      "                            \"name\": \"HAS_TOPIC\"\n",
      "                        }\n",
      "                    ],\n",
      "                    \"unwind\": \"topics\"\n",
      "                }\n",
      "            ],\n",
      "            \"people\": [\n",
      "                {\n",
      "                    \"cols\": [\n",
      "                        \"name\",\n",
      "                        \"gender\"\n",
      "                    ],\n",
      "                    \"node_name\": \"Person\",\n",
      "                    \"ref\": \"p\"\n",
      "                },\n",
      "                {\n",
      "                    \"cols\": [\n",
      "                        \"award_id\"\n",
      "                    ],\n",
      "                    \"needs\": \"p\",\n",
      "                    \"node_name\": \"Award\",\n",
      "                    \"ref\": \"aw\",\n",
      "                    \"relations\": [\n",
      "                        {\n",
      "                            \"begins\": \"p\",\n",
      "                            \"begins_dir\": \"-\",\n",
      "                            \"ends\": \"aw\",\n",
      "                            \"ends_dir\": \"->\",\n",
      "                            \"name\": \"WON\"\n",
      "                        },\n",
      "                        {\n",
      "                            \"begins\": \"p\",\n",
      "                            \"begins_dir\": \"-\",\n",
      "                            \"ends\": \"aw\",\n",
      "                            \"ends_dir\": \"->\",\n",
      "                            \"name\": \"NOMINATED\"\n",
      "                        }\n",
      "                    ],\n",
      "                    \"unwind\": \"awards_won\"\n",
      "                },\n",
      "                {\n",
      "                    \"cols\": [\n",
      "                        \"award_id\"\n",
      "                    ],\n",
      "                    \"needs\": \"p\",\n",
      "                    \"node_name\": \"Award\",\n",
      "                    \"ref\": \"an\",\n",
      "                    \"relations\": [\n",
      "                        {\n",
      "                            \"begins\": \"p\",\n",
      "                            \"begins_dir\": \"-\",\n",
      "                            \"ends\": \"an\",\n",
      "                            \"ends_dir\": \"->\",\n",
      "                            \"name\": \"NOMINATED\"\n",
      "                        }\n",
      "                    ],\n",
      "                    \"unwind\": \"awards_nominated\"\n",
      "                }\n",
      "            ],\n",
      "            \"topics\": [\n",
      "                {\n",
      "                    \"cols\": [\n",
      "                        \"topic_id\",\n",
      "                        \"topics\"\n",
      "                    ],\n",
      "                    \"node_name\": \"Topic\",\n",
      "                    \"ref\": \"t\"\n",
      "                }\n",
      "            ]\n",
      "        }\n",
      "    },\n",
      "    \"neo4j\": {\n",
      "        \"cap_insert\": 70000,\n",
      "        \"clear_data\": true,\n",
      "        \"db\": null,\n",
      "        \"file_folder\": \"../import/\",\n",
      "        \"insertion_mode\": \"rows\",\n",
      "        \"password\": \"1234\",\n",
      "        \"uri\": \"bolt://localhost:7687\",\n",
      "        \"username\": \"neo4j\"\n",
      "    },\n",
      "    \"transform\": {\n",
      "        \"awards_nominated\": {\n",
      "            \"column_map\": {\n",
      "                \"award_company\": \"award_company\",\n",
      "                \"award_type\": \"award_type\",\n",
      "                \"movie\": \"movie\",\n",
      "                \"person\": \"person\",\n",
      "                \"year\": \"year\"\n",
      "            }\n",
      "        },\n",
      "        \"awards_won\": {\n",
      "            \"column_map\": {\n",
      "                \"award_company\": \"award_company\",\n",
      "                \"award_type\": \"award_type\",\n",
      "                \"movie\": \"movie\",\n",
      "                \"person\": \"person\",\n",
      "                \"year\": \"year\"\n",
      "            }\n",
      "        },\n",
      "        \"cast\": {\n",
      "            \"column_map\": {\n",
      "                \"actor1_gender\": \"actor1_gender\",\n",
      "                \"actor1_name\": \"actor1_name\",\n",
      "                \"actor2_gender\": \"actor2_gender\",\n",
      "                \"actor2_name\": \"actor2_name\",\n",
      "                \"actor3_gender\": \"actor3_gender\",\n",
      "                \"actor3_name\": \"actor3_name\",\n",
      "                \"actor4_gender\": \"actor4_gender\",\n",
      "                \"actor4_name\": \"actor4_name\",\n",
      "                \"actor5_gender\": \"actor5_gender\",\n",
      "                \"actor5_name\": \"actor5_name\",\n",
      "                \"director_gender\": \"director_gender\",\n",
      "                \"director_name\": \"director_name\",\n",
      "                \"id\": \"movie_id\"\n",
      "            }\n",
      "        },\n",
      "        \"directors\": {\n",
      "            \"column_map\": {\n",
      "                \"Academy Fellowship\": \"acad_fellow\",\n",
      "                \"name\": \"name\"\n",
      "            }\n",
      "        },\n",
      "        \"movies\": {\n",
      "            \"column_map\": {\n",
      "                \"budget\": \"budget\",\n",
      "                \"genres\": \"genres\",\n",
      "                \"id\": \"movie_id\",\n",
      "                \"imdb_id\": \"imdb_id\",\n",
      "                \"original_language\": \"lang\",\n",
      "                \"overview\": \"overview\",\n",
      "                \"production_companies\": \"company\",\n",
      "                \"revenue\": \"revenue\",\n",
      "                \"runtime\": \"runtime\",\n",
      "                \"title\": \"title\",\n",
      "                \"vote_average\": \"vote_average\",\n",
      "                \"vote_count\": \"vote_count\"\n",
      "            }\n",
      "        },\n",
      "        \"topics\": {\n",
      "            \"column_map\": {\n",
      "                \"0\": \"topic_0\",\n",
      "                \"1\": \"topic_1\",\n",
      "                \"2\": \"topic_2\",\n",
      "                \"3\": \"topic_3\",\n",
      "                \"4\": \"topic_4\",\n",
      "                \"5\": \"topic_5\",\n",
      "                \"6\": \"topic_6\",\n",
      "                \"7\": \"topic_7\",\n",
      "                \"8\": \"topic_8\",\n",
      "                \"9\": \"topic_9\"\n",
      "            }\n",
      "        },\n",
      "        \"topics_movies\": {\n",
      "            \"column_map\": {\n",
      "                \"movie_id\": \"movie_id\",\n",
      "                \"topic\": \"topic_id\"\n",
      "            }\n",
      "        }\n",
      "    }\n",
      "}\n",
      "======\n"
     ]
    }
   ],
   "source": [
    "from utils import utils\n",
    "from app import run_app, App\n",
    "from core.gen_topics import gen_topics\n",
    "from graphneo4j import GraphNeo4j\n",
    "import warnings\n",
    "warnings.filterwarnings(\"ignore\") # supress all the warnigns\n",
    "\n",
    "settings = utils.get_settings_notebook('../settings.json')\n",
    "utils.pretty_print(settings)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b87e8d21-d969-4ecf-ba4b-c4b3f51979f9",
   "metadata": {},
   "source": [
    "## Load the data from csv files"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "ee480236-1015-47a4-aa06-39ecef44f667",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (n) DETACH DELETE n\n",
      "=========  Crwaler award_won ========\n",
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 598 entries, 0 to 597\n",
      "Data columns (total 5 columns):\n",
      " #   Column         Non-Null Count  Dtype \n",
      "---  ------         --------------  ----- \n",
      " 0   award_company  598 non-null    object\n",
      " 1   award_type     598 non-null    object\n",
      " 2   movie          597 non-null    object\n",
      " 3   person         597 non-null    object\n",
      " 4   year           598 non-null    object\n",
      "dtypes: object(5)\n",
      "memory usage: 23.5+ KB\n",
      "None\n",
      "========= end ========\n",
      "=========  Crwaler award_nominated ========\n",
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 2832 entries, 0 to 2831\n",
      "Data columns (total 5 columns):\n",
      " #   Column         Non-Null Count  Dtype \n",
      "---  ------         --------------  ----- \n",
      " 0   award_company  2832 non-null   object\n",
      " 1   award_type     2832 non-null   object\n",
      " 2   movie          2816 non-null   object\n",
      " 3   person         2243 non-null   object\n",
      " 4   year           2832 non-null   object\n",
      "dtypes: object(5)\n",
      "memory usage: 110.8+ KB\n",
      "None\n",
      "========= end ========\n",
      "==== TRANSFORM topics ====\n",
      "==== TRANSFORM topics_movies ====\n",
      "==== TRANSFORM awards_won ====\n",
      "==== TRANSFORM awards_nominated ====\n",
      "==== TRANSFORM directors ====\n",
      "==== TRANSFORM movies ====\n",
      "==== TRANSFORM cast ====\n"
     ]
    }
   ],
   "source": [
    "app = App(settings)\n",
    "dfs = app.extract_transform()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "28f6674b-5f67-4377-8b9b-14956b1ce34b",
   "metadata": {},
   "source": [
    "## Generate topics\n",
    "  - Use this section to generate the csv's for topics and keywords"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "6b97ff13-dc68-4602-ad98-546c634a3cbd",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2022-12-10 09:18:37 INFO: Checking for updates to resources.json in case models have been updated.  Note: this behavior can be turned off with download_method=None or download_method=DownloadMethod.REUSE_RESOURCES\n",
      "2022-12-10 09:18:37,186 : INFO : Checking for updates to resources.json in case models have been updated.  Note: this behavior can be turned off with download_method=None or download_method=DownloadMethod.REUSE_RESOURCES\n",
      "Downloading https://raw.githubusercontent.com/stanfordnlp/stanza-resources/main/resources_1.4.1.json: 193kB [00:00, 4.54MB/s]                                                                                                               \n",
      "2022-12-10 09:18:38 INFO: Loading these models for language: en (English):\n",
      "============================\n",
      "| Processor    | Package   |\n",
      "----------------------------\n",
      "| tokenize     | combined  |\n",
      "| pos          | combined  |\n",
      "| lemma        | combined  |\n",
      "| depparse     | combined  |\n",
      "| sentiment    | sstplus   |\n",
      "| constituency | wsj       |\n",
      "| ner          | ontonotes |\n",
      "============================\n",
      "\n",
      "2022-12-10 09:18:38,534 : INFO : Loading these models for language: en (English):\n",
      "============================\n",
      "| Processor    | Package   |\n",
      "----------------------------\n",
      "| tokenize     | combined  |\n",
      "| pos          | combined  |\n",
      "| lemma        | combined  |\n",
      "| depparse     | combined  |\n",
      "| sentiment    | sstplus   |\n",
      "| constituency | wsj       |\n",
      "| ner          | ontonotes |\n",
      "============================\n",
      "\n",
      "2022-12-10 09:18:38 INFO: Use device: gpu\n",
      "2022-12-10 09:18:38,535 : INFO : Use device: gpu\n",
      "2022-12-10 09:18:38 INFO: Loading: tokenize\n",
      "2022-12-10 09:18:38,535 : INFO : Loading: tokenize\n",
      "2022-12-10 09:18:40 INFO: Loading: pos\n",
      "2022-12-10 09:18:40,125 : INFO : Loading: pos\n",
      "2022-12-10 09:18:40 INFO: Loading: lemma\n",
      "2022-12-10 09:18:40,381 : INFO : Loading: lemma\n",
      "2022-12-10 09:18:40 INFO: Loading: depparse\n",
      "2022-12-10 09:18:40,408 : INFO : Loading: depparse\n",
      "2022-12-10 09:18:40 INFO: Loading: sentiment\n",
      "2022-12-10 09:18:40,573 : INFO : Loading: sentiment\n",
      "2022-12-10 09:18:40 INFO: Loading: constituency\n",
      "2022-12-10 09:18:40,885 : INFO : Loading: constituency\n",
      "2022-12-10 09:18:41 INFO: Loading: ner\n",
      "2022-12-10 09:18:41,220 : INFO : Loading: ner\n",
      "2022-12-10 09:18:41 INFO: Done loading processors!\n",
      "2022-12-10 09:18:41,605 : INFO : Done loading processors!\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "      <th>2</th>\n",
       "      <th>3</th>\n",
       "      <th>4</th>\n",
       "      <th>5</th>\n",
       "      <th>6</th>\n",
       "      <th>7</th>\n",
       "      <th>8</th>\n",
       "      <th>9</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>\"bill\"</td>\n",
       "      <td>\"life\"</td>\n",
       "      <td>\"make\"</td>\n",
       "      <td>\"last\"</td>\n",
       "      <td>\"list\"</td>\n",
       "      <td>\"live\"</td>\n",
       "      <td>\"death\"</td>\n",
       "      <td>\"wrong\"</td>\n",
       "      <td>\"payback\"</td>\n",
       "      <td>\"shoot\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>\"film\"</td>\n",
       "      <td>\"suicide\"</td>\n",
       "      <td>\"life\"</td>\n",
       "      <td>\"escape\"</td>\n",
       "      <td>\"force\"</td>\n",
       "      <td>\"evidence\"</td>\n",
       "      <td>\"hold\"</td>\n",
       "      <td>\"master\"</td>\n",
       "      <td>\"star\"</td>\n",
       "      <td>\"political\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>\"life\"</td>\n",
       "      <td>\"mission\"</td>\n",
       "      <td>\"exist\"</td>\n",
       "      <td>\"record\"</td>\n",
       "      <td>\"set\"</td>\n",
       "      <td>\"daughter\"</td>\n",
       "      <td>\"help\"</td>\n",
       "      <td>\"man\"</td>\n",
       "      <td>\"film\"</td>\n",
       "      <td>\"green\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>\"put\"</td>\n",
       "      <td>\"send\"</td>\n",
       "      <td>\"get\"</td>\n",
       "      <td>\"force\"</td>\n",
       "      <td>\"back\"</td>\n",
       "      <td>\"unit\"</td>\n",
       "      <td>\"want\"</td>\n",
       "      <td>\"boot\"</td>\n",
       "      <td>\"cheat\"</td>\n",
       "      <td>\"kill\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>\"man\"</td>\n",
       "      <td>\"young\"</td>\n",
       "      <td>\"commit\"</td>\n",
       "      <td>\"start\"</td>\n",
       "      <td>\"death\"</td>\n",
       "      <td>\"involve\"</td>\n",
       "      <td>\"garbage\"</td>\n",
       "      <td>\"much\"</td>\n",
       "      <td>\"worker\"</td>\n",
       "      <td>\"nikander\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3995</th>\n",
       "      <td>\"allow\"</td>\n",
       "      <td>\"city\"</td>\n",
       "      <td>\"station\"</td>\n",
       "      <td>\"lucchini\"</td>\n",
       "      <td>\"conne\"</td>\n",
       "      <td>\"creation\"</td>\n",
       "      <td>\"include\"</td>\n",
       "      <td>\"involve\"</td>\n",
       "      <td>\"mathematician\"</td>\n",
       "      <td>\"alain\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3996</th>\n",
       "      <td>\"space\"</td>\n",
       "      <td>\"base\"</td>\n",
       "      <td>\"film\"</td>\n",
       "      <td>\"anime\"</td>\n",
       "      <td>\"lot\"</td>\n",
       "      <td>\"woman\"</td>\n",
       "      <td>\"home\"</td>\n",
       "      <td>\"remake\"</td>\n",
       "      <td>\"adventurer\"</td>\n",
       "      <td>\"monster\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3997</th>\n",
       "      <td>\"queen\"</td>\n",
       "      <td>\"castle\"</td>\n",
       "      <td>\"daughter\"</td>\n",
       "      <td>\"language\"</td>\n",
       "      <td>\"royalty\"</td>\n",
       "      <td>\"direct\"</td>\n",
       "      <td>\"version\"</td>\n",
       "      <td>\"german\"</td>\n",
       "      <td>\"make\"</td>\n",
       "      <td>\"marry\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3998</th>\n",
       "      <td>\"girl\"</td>\n",
       "      <td>\"life\"</td>\n",
       "      <td>\"filmmaker\"</td>\n",
       "      <td>\"meet\"</td>\n",
       "      <td>\"follow\"</td>\n",
       "      <td>\"break\"</td>\n",
       "      <td>\"courage\"</td>\n",
       "      <td>\"story\"</td>\n",
       "      <td>\"bleak\"</td>\n",
       "      <td>\"find\"</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3999</th>\n",
       "      <td>\"drama\"</td>\n",
       "      <td>\"red\"</td>\n",
       "      <td>\"silent\"</td>\n",
       "      <td>\"robe\"</td>\n",
       "      <td>\"set\"</td>\n",
       "      <td>\"world\"</td>\n",
       "      <td>\"plot\"</td>\n",
       "      <td>\"unknown\"</td>\n",
       "      <td>\"art\"</td>\n",
       "      <td>\"richelieu\"</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>4000 rows × 10 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "            0          1            2           3          4           5  \\\n",
       "0      \"bill\"     \"life\"       \"make\"      \"last\"     \"list\"      \"live\"   \n",
       "1      \"film\"  \"suicide\"       \"life\"    \"escape\"    \"force\"  \"evidence\"   \n",
       "2      \"life\"  \"mission\"      \"exist\"    \"record\"      \"set\"  \"daughter\"   \n",
       "3       \"put\"     \"send\"        \"get\"     \"force\"     \"back\"      \"unit\"   \n",
       "4       \"man\"    \"young\"     \"commit\"     \"start\"    \"death\"   \"involve\"   \n",
       "...       ...        ...          ...         ...        ...         ...   \n",
       "3995  \"allow\"     \"city\"    \"station\"  \"lucchini\"    \"conne\"  \"creation\"   \n",
       "3996  \"space\"     \"base\"       \"film\"     \"anime\"      \"lot\"     \"woman\"   \n",
       "3997  \"queen\"   \"castle\"   \"daughter\"  \"language\"  \"royalty\"    \"direct\"   \n",
       "3998   \"girl\"     \"life\"  \"filmmaker\"      \"meet\"   \"follow\"     \"break\"   \n",
       "3999  \"drama\"      \"red\"     \"silent\"      \"robe\"      \"set\"     \"world\"   \n",
       "\n",
       "              6          7                8            9  \n",
       "0       \"death\"    \"wrong\"        \"payback\"      \"shoot\"  \n",
       "1        \"hold\"   \"master\"           \"star\"  \"political\"  \n",
       "2        \"help\"      \"man\"           \"film\"      \"green\"  \n",
       "3        \"want\"     \"boot\"          \"cheat\"       \"kill\"  \n",
       "4     \"garbage\"     \"much\"         \"worker\"   \"nikander\"  \n",
       "...         ...        ...              ...          ...  \n",
       "3995  \"include\"  \"involve\"  \"mathematician\"      \"alain\"  \n",
       "3996     \"home\"   \"remake\"     \"adventurer\"    \"monster\"  \n",
       "3997  \"version\"   \"german\"           \"make\"      \"marry\"  \n",
       "3998  \"courage\"    \"story\"          \"bleak\"       \"find\"  \n",
       "3999     \"plot\"  \"unknown\"            \"art\"  \"richelieu\"  \n",
       "\n",
       "[4000 rows x 10 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movie_id</th>\n",
       "      <th>topic</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>12</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>13</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>14</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11995</th>\n",
       "      <td>461955</td>\n",
       "      <td>3998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11996</th>\n",
       "      <td>462894</td>\n",
       "      <td>3992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11997</th>\n",
       "      <td>463019</td>\n",
       "      <td>3990</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11998</th>\n",
       "      <td>463026</td>\n",
       "      <td>3990</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11999</th>\n",
       "      <td>463684</td>\n",
       "      <td>3992</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>12000 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      movie_id topic\n",
       "0            2     4\n",
       "1            3     4\n",
       "2           12     7\n",
       "3           13     8\n",
       "4           14     2\n",
       "...        ...   ...\n",
       "11995   461955  3998\n",
       "11996   462894  3992\n",
       "11997   463019  3990\n",
       "11998   463026  3990\n",
       "11999   463684  3992\n",
       "\n",
       "[12000 rows x 2 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "movie_topics = gen_topics()\n",
    "# (df_movie_topics, df_topic_words) = movie_topics.batch_process(data_df['movies'][data_df['movies']['lang'] == 'en'])\n",
    "(df_movie_topics, df_topic_words) = movie_topics.batch_process(dfs['movies'][\n",
    "    dfs['movies']['overview'].apply(lambda x: x is not None and len(x) > 30)\n",
    "])\n",
    "df_topic_words.reset_index(drop=True, inplace=True)\n",
    "df_movie_topics.reset_index(drop=True, inplace=True)\n",
    "display(df_topic_words)\n",
    "display(df_movie_topics)\n",
    "df_topic_words.to_csv('./files/archive/topic_words.csv', index=True)\n",
    "df_movie_topics.to_csv('./files/archive/movie_topic_ids.csv', index=True)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "86888a06-1cde-4630-8edc-73fe013c568e",
   "metadata": {},
   "source": [
    "## Load the dataframes into graph database (Neo4j)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "910deba8-de81-49e6-95e8-578791874642",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=========  Crwaler award_won ========\n",
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 598 entries, 0 to 597\n",
      "Data columns (total 5 columns):\n",
      " #   Column         Non-Null Count  Dtype \n",
      "---  ------         --------------  ----- \n",
      " 0   award_company  598 non-null    object\n",
      " 1   award_type     598 non-null    object\n",
      " 2   movie          597 non-null    object\n",
      " 3   person         597 non-null    object\n",
      " 4   year           598 non-null    object\n",
      "dtypes: object(5)\n",
      "memory usage: 23.5+ KB\n",
      "None\n",
      "========= end ========\n",
      "=========  Crwaler award_nominated ========\n",
      "<class 'pandas.core.frame.DataFrame'>\n",
      "RangeIndex: 2832 entries, 0 to 2831\n",
      "Data columns (total 5 columns):\n",
      " #   Column         Non-Null Count  Dtype \n",
      "---  ------         --------------  ----- \n",
      " 0   award_company  2832 non-null   object\n",
      " 1   award_type     2832 non-null   object\n",
      " 2   movie          2816 non-null   object\n",
      " 3   person         2243 non-null   object\n",
      " 4   year           2832 non-null   object\n",
      "dtypes: object(5)\n",
      "memory usage: 110.8+ KB\n",
      "None\n",
      "========= end ========\n",
      "==== TRANSFORM topics ====\n",
      "==== TRANSFORM topics_movies ====\n",
      "==== TRANSFORM awards_won ====\n",
      "==== TRANSFORM awards_nominated ====\n",
      "==== TRANSFORM directors ====\n",
      "==== TRANSFORM movies ====\n",
      "==== TRANSFORM cast ====\n",
      "CREATE CONSTRAINT Topics\n",
      "        IF NOT EXISTS ON (c:Topic)\n",
      "        ASSERT c.id IS UNIQUE\n",
      "CREATE CONSTRAINT Awards\n",
      "        IF NOT EXISTS ON (c:Award)\n",
      "        ASSERT c.award_id IS UNIQUE\n",
      "CREATE CONSTRAINT Companies\n",
      "        IF NOT EXISTS ON (c:Company)\n",
      "        ASSERT c.name IS UNIQUE\n",
      "CREATE CONSTRAINT Genres\n",
      "        IF NOT EXISTS ON (c:Genre)\n",
      "        ASSERT c.name IS UNIQUE\n",
      "CREATE CONSTRAINT People\n",
      "        IF NOT EXISTS ON (c:Person)\n",
      "        ASSERT c.name IS UNIQUE\n",
      "CREATE CONSTRAINT Movies\n",
      "        IF NOT EXISTS ON (c:Movie)\n",
      "        ASSERT c.movie_id IS UNIQUE\n",
      "batch 0\n",
      "UNWIND $rows AS row\n",
      "\n",
      "MERGE (t:Topic {topic_id: row.topic_id, topics: row.topics})\n",
      "\n",
      "RETURN count(*) as total\n",
      "batch 1\n",
      "batch 2\n",
      "batch 3\n",
      "batch 4\n",
      "batch 5\n",
      "batch 6\n",
      "batch 0\n",
      "UNWIND $rows AS row\n",
      "\n",
      "MERGE (aw:Award {award_id: row.award_id, award_company: row.award_company, award_type: row.award_type, year: row.year})\n",
      "\n",
      "RETURN count(*) as total\n",
      "batch 1\n",
      "batch 2\n",
      "batch 3\n",
      "batch 4\n",
      "batch 5\n",
      "batch 6\n",
      "batch 0\n",
      "UNWIND $rows AS row\n",
      "\n",
      "MERGE (c:Company {name: row.name})\n",
      "\n",
      "RETURN count(*) as total\n",
      "batch 1\n",
      "batch 2\n",
      "batch 3\n",
      "batch 4\n",
      "batch 5\n",
      "batch 6\n",
      "batch 0\n",
      "UNWIND $rows AS row\n",
      "\n",
      "MERGE (p:Person {name: row.name, gender: row.gender})\n",
      "\n",
      "WITH row, p\n",
      "UNWIND row.awards_won AS awards_won\n",
      "MATCH (aw:Award {award_id: awards_won.award_id})\n",
      "MERGE (p)-[:WON]->(aw)\n",
      "MERGE (p)-[:NOMINATED]->(aw)\n",
      "WITH row, p\n",
      "UNWIND row.awards_nominated AS awards_nominated\n",
      "MATCH (an:Award {award_id: awards_nominated.award_id})\n",
      "MERGE (p)-[:NOMINATED]->(an)\n",
      "RETURN count(*) as total\n",
      "batch 1\n",
      "batch 2\n",
      "batch 3\n",
      "batch 4\n",
      "batch 5\n",
      "batch 6\n",
      "batch 0\n",
      "UNWIND $rows AS row\n",
      "\n",
      "MERGE (g:Genre {name: row.name})\n",
      "\n",
      "RETURN count(*) as total\n",
      "batch 1\n",
      "batch 2\n",
      "batch 3\n",
      "batch 4\n",
      "batch 5\n",
      "batch 6\n",
      "batch 0\n",
      "UNWIND $rows AS row\n",
      "\n",
      "MERGE (m:Movie {movie_id: row.movie_id, imdb_id: row.imdb_id, lang: row.lang, title: row.title, overview: row.overview})\n",
      "\n",
      "WITH row, m\n",
      "UNWIND row.directors AS directors\n",
      "MATCH (d:Person {name: directors.name})\n",
      "MERGE (d)-[:DIRECTED]->(m)\n",
      "WITH row, m\n",
      "UNWIND row.companies AS companies\n",
      "MATCH (c:Company {name: companies.name})\n",
      "MERGE (c)-[:PRODUCED]->(m)\n",
      "WITH row, m\n",
      "UNWIND row.genres AS genres\n",
      "MATCH (g:Genre {name: genres.name})\n",
      "MERGE (m)-[:HAS_GENRE]->(g)\n",
      "WITH row, m\n",
      "UNWIND row.actors AS actors\n",
      "MATCH (a:Person {name: actors.name})\n",
      "MERGE (a)-[:ACTED_IN]->(m)\n",
      "WITH row, m\n",
      "UNWIND row.awards_won AS awards_won\n",
      "MATCH (aw:Award {award_id: awards_won.award_id})\n",
      "MERGE (m)-[:WON]->(aw)\n",
      "MERGE (m)-[:NOMINATED]->(aw)\n",
      "WITH row, m\n",
      "UNWIND row.awards_nominated AS awards_nominated\n",
      "MATCH (an:Award {award_id: awards_nominated.award_id})\n",
      "MERGE (m)-[:NOMINATED]->(an)\n",
      "WITH row, m\n",
      "UNWIND row.topics AS topics\n",
      "MATCH (t:Topic {topic_id: topics.topic_id})\n",
      "MERGE (m)-[:HAS_TOPIC]->(t)\n",
      "RETURN count(*) as total\n",
      "batch 1\n",
      "batch 2\n",
      "batch 3\n",
      "batch 4\n",
      "batch 5\n",
      "batch 6\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<graphneo4j.graphneo4j.GraphNeo4j at 0x7fe1e44e8850>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "app.etl()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "eb51e3bb-f95f-4272-be98-3846bec99b43",
   "metadata": {},
   "source": [
    "## Display the final dataframe for the movies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "9236552e-9147-4873-a8d4-5548f26afda9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>movie_id</th>\n",
       "      <th>imdb_id</th>\n",
       "      <th>lang</th>\n",
       "      <th>title</th>\n",
       "      <th>overview</th>\n",
       "      <th>vote_average</th>\n",
       "      <th>vote_count</th>\n",
       "      <th>budget</th>\n",
       "      <th>revenue</th>\n",
       "      <th>runtime</th>\n",
       "      <th>genres</th>\n",
       "      <th>actors</th>\n",
       "      <th>directors</th>\n",
       "      <th>companies</th>\n",
       "      <th>awards_won</th>\n",
       "      <th>awards_nominated</th>\n",
       "      <th>topics</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>tt0094675</td>\n",
       "      <td>fi</td>\n",
       "      <td>Ariel</td>\n",
       "      <td>Taisto Kasurinen is a Finnish coal miner whose...</td>\n",
       "      <td>7.1</td>\n",
       "      <td>40</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>69.0</td>\n",
       "      <td>[{'name': 'Drama'}, {'name': 'Crime'}]</td>\n",
       "      <td>[{'name': 'Matti Pellonpaa', 'gender': 2}, {'n...</td>\n",
       "      <td>[{'name': 'Aki Kaurismaki', 'gender': 0.0}]</td>\n",
       "      <td>[{'name': 'Villealfa Filmproduction Oy'}]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[{'topic_id': 4}]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3</td>\n",
       "      <td>tt0092149</td>\n",
       "      <td>fi</td>\n",
       "      <td>Shadows in Paradise</td>\n",
       "      <td>An episode in the life of Nikander, a garbage ...</td>\n",
       "      <td>7.0</td>\n",
       "      <td>32</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>76.0</td>\n",
       "      <td>[{'name': 'Drama'}, {'name': 'Comedy'}]</td>\n",
       "      <td>[{'name': 'Matti Pellonpaa', 'gender': 2}, {'n...</td>\n",
       "      <td>[{'name': 'Aki Kaurismaki', 'gender': 0.0}]</td>\n",
       "      <td>[{'name': 'Villealfa Filmproduction Oy'}]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[{'topic_id': 4}]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>12</td>\n",
       "      <td>tt0266543</td>\n",
       "      <td>en</td>\n",
       "      <td>Finding Nemo</td>\n",
       "      <td>Nemo, an adventurous young clownfish, is unexp...</td>\n",
       "      <td>7.6</td>\n",
       "      <td>5531</td>\n",
       "      <td>94000000</td>\n",
       "      <td>940335536</td>\n",
       "      <td>100.0</td>\n",
       "      <td>[{'name': 'Animation'}, {'name': 'Family'}]</td>\n",
       "      <td>[{'name': 'Albert Brooks', 'gender': 2}, {'nam...</td>\n",
       "      <td>[{'name': 'Andrew Stanton', 'gender': 2.0}]</td>\n",
       "      <td>[{'name': 'Pixar Animation Studios'}]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[{'topic_id': 7}]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>13</td>\n",
       "      <td>tt0109830</td>\n",
       "      <td>en</td>\n",
       "      <td>Forrest Gump</td>\n",
       "      <td>A man with a low IQ has accomplished great thi...</td>\n",
       "      <td>8.2</td>\n",
       "      <td>7204</td>\n",
       "      <td>55000000</td>\n",
       "      <td>677945399</td>\n",
       "      <td>142.0</td>\n",
       "      <td>[{'name': 'Comedy'}, {'name': 'Drama'}, {'name...</td>\n",
       "      <td>[{'name': 'Tom Hanks', 'gender': 2}, {'name': ...</td>\n",
       "      <td>[{'name': 'Robert Zemeckis', 'gender': 2.0}]</td>\n",
       "      <td>[{'name': 'Paramount Pictures'}]</td>\n",
       "      <td>[{'award_id': 66}, {'award_id': 160}, {'award_...</td>\n",
       "      <td>[{'award_id': 1498}]</td>\n",
       "      <td>[{'topic_id': 8}]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>14</td>\n",
       "      <td>tt0169547</td>\n",
       "      <td>en</td>\n",
       "      <td>American Beauty</td>\n",
       "      <td>Lester Burnham, a depressed suburban father in...</td>\n",
       "      <td>7.9</td>\n",
       "      <td>2994</td>\n",
       "      <td>15000000</td>\n",
       "      <td>356296601</td>\n",
       "      <td>122.0</td>\n",
       "      <td>[{'name': 'Drama'}]</td>\n",
       "      <td>[{'name': 'Kevin Spacey', 'gender': 2}, {'name...</td>\n",
       "      <td>[{'name': 'Sam Mendes', 'gender': 2.0}]</td>\n",
       "      <td>[{'name': 'DreamWorks SKG'}]</td>\n",
       "      <td>[{'award_id': 71}, {'award_id': 165}, {'award_...</td>\n",
       "      <td>[{'award_id': 259}, {'award_id': 1523}, {'awar...</td>\n",
       "      <td>[{'topic_id': 2}]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12149</th>\n",
       "      <td>468134</td>\n",
       "      <td>tt0174108</td>\n",
       "      <td>en</td>\n",
       "      <td>Paviljon VI</td>\n",
       "      <td>A doctor from provincial town in Tsardom of Ru...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>97.0</td>\n",
       "      <td>[{'name': 'Drama'}]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[{'name': 'Lucian Pintilie', 'gender': 2.0}]</td>\n",
       "      <td>[{'name': 'Centar Film'}]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12150</th>\n",
       "      <td>468188</td>\n",
       "      <td>tt0020291</td>\n",
       "      <td>en</td>\n",
       "      <td>Prisoners</td>\n",
       "      <td>Prisoners was a 1929 American film directed by...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>87.0</td>\n",
       "      <td>[{'name': 'Drama'}]</td>\n",
       "      <td>[{'name': 'Ian Keith', 'gender': 2}, {'name': ...</td>\n",
       "      <td>[{'name': 'William A Seiter', 'gender': 2.0}]</td>\n",
       "      <td>[{'name': 'First National Pictures'}]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12151</th>\n",
       "      <td>468335</td>\n",
       "      <td>tt0020128</td>\n",
       "      <td>en</td>\n",
       "      <td>Madonna of Avenue A</td>\n",
       "      <td>Madonna of Avenue A is a 1929 talking drama fi...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>71.0</td>\n",
       "      <td>[{'name': 'Drama'}]</td>\n",
       "      <td>[{'name': 'Dolores Costello', 'gender': 1.0}, ...</td>\n",
       "      <td>[{'name': 'Michael Curtiz', 'gender': 0.0}]</td>\n",
       "      <td>[{'name': 'Warner Bros.'}]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12152</th>\n",
       "      <td>468749</td>\n",
       "      <td>tt0083115</td>\n",
       "      <td>en</td>\n",
       "      <td>Splendor in the Grass</td>\n",
       "      <td>Splendor in the Grass is a made-for-TV movie s...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>100.0</td>\n",
       "      <td>[{'name': 'Drama'}]</td>\n",
       "      <td>[{'name': 'Michelle Pfeiffer', 'gender': 1.0},...</td>\n",
       "      <td>[{'name': 'Richard C Sarafian', 'gender': 0.0}]</td>\n",
       "      <td>[{'name': 'none'}]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12153</th>\n",
       "      <td>468923</td>\n",
       "      <td>tt4607540</td>\n",
       "      <td>en</td>\n",
       "      <td>Back to the Future: Hilarious Outtakes</td>\n",
       "      <td>A short blooper reel from the filming of the 1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>3.0</td>\n",
       "      <td>[{'name': 'Comedy'}]</td>\n",
       "      <td>[{'name': 'Michael J Fox', 'gender': 2.0}, {'n...</td>\n",
       "      <td>[{'name': 'Robert Zemeckis', 'gender': 2.0}]</td>\n",
       "      <td>[{'name': 'Universal Pictures'}]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>12154 rows × 17 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       movie_id    imdb_id lang                                   title  \\\n",
       "0             2  tt0094675   fi                                   Ariel   \n",
       "1             3  tt0092149   fi                     Shadows in Paradise   \n",
       "2            12  tt0266543   en                            Finding Nemo   \n",
       "3            13  tt0109830   en                            Forrest Gump   \n",
       "4            14  tt0169547   en                         American Beauty   \n",
       "...         ...        ...  ...                                     ...   \n",
       "12149    468134  tt0174108   en                             Paviljon VI   \n",
       "12150    468188  tt0020291   en                               Prisoners   \n",
       "12151    468335  tt0020128   en                     Madonna of Avenue A   \n",
       "12152    468749  tt0083115   en                   Splendor in the Grass   \n",
       "12153    468923  tt4607540   en  Back to the Future: Hilarious Outtakes   \n",
       "\n",
       "                                                overview  vote_average  \\\n",
       "0      Taisto Kasurinen is a Finnish coal miner whose...           7.1   \n",
       "1      An episode in the life of Nikander, a garbage ...           7.0   \n",
       "2      Nemo, an adventurous young clownfish, is unexp...           7.6   \n",
       "3      A man with a low IQ has accomplished great thi...           8.2   \n",
       "4      Lester Burnham, a depressed suburban father in...           7.9   \n",
       "...                                                  ...           ...   \n",
       "12149  A doctor from provincial town in Tsardom of Ru...           0.0   \n",
       "12150  Prisoners was a 1929 American film directed by...           0.0   \n",
       "12151  Madonna of Avenue A is a 1929 talking drama fi...           0.0   \n",
       "12152  Splendor in the Grass is a made-for-TV movie s...           0.0   \n",
       "12153  A short blooper reel from the filming of the 1...           0.0   \n",
       "\n",
       "       vote_count    budget    revenue  runtime  \\\n",
       "0              40         0          0     69.0   \n",
       "1              32         0          0     76.0   \n",
       "2            5531  94000000  940335536    100.0   \n",
       "3            7204  55000000  677945399    142.0   \n",
       "4            2994  15000000  356296601    122.0   \n",
       "...           ...       ...        ...      ...   \n",
       "12149           0         0          0     97.0   \n",
       "12150           0         0          0     87.0   \n",
       "12151           0         0          0     71.0   \n",
       "12152           0         0          0    100.0   \n",
       "12153           0         0          0      3.0   \n",
       "\n",
       "                                                  genres  \\\n",
       "0                 [{'name': 'Drama'}, {'name': 'Crime'}]   \n",
       "1                [{'name': 'Drama'}, {'name': 'Comedy'}]   \n",
       "2            [{'name': 'Animation'}, {'name': 'Family'}]   \n",
       "3      [{'name': 'Comedy'}, {'name': 'Drama'}, {'name...   \n",
       "4                                    [{'name': 'Drama'}]   \n",
       "...                                                  ...   \n",
       "12149                                [{'name': 'Drama'}]   \n",
       "12150                                [{'name': 'Drama'}]   \n",
       "12151                                [{'name': 'Drama'}]   \n",
       "12152                                [{'name': 'Drama'}]   \n",
       "12153                               [{'name': 'Comedy'}]   \n",
       "\n",
       "                                                  actors  \\\n",
       "0      [{'name': 'Matti Pellonpaa', 'gender': 2}, {'n...   \n",
       "1      [{'name': 'Matti Pellonpaa', 'gender': 2}, {'n...   \n",
       "2      [{'name': 'Albert Brooks', 'gender': 2}, {'nam...   \n",
       "3      [{'name': 'Tom Hanks', 'gender': 2}, {'name': ...   \n",
       "4      [{'name': 'Kevin Spacey', 'gender': 2}, {'name...   \n",
       "...                                                  ...   \n",
       "12149                                                 []   \n",
       "12150  [{'name': 'Ian Keith', 'gender': 2}, {'name': ...   \n",
       "12151  [{'name': 'Dolores Costello', 'gender': 1.0}, ...   \n",
       "12152  [{'name': 'Michelle Pfeiffer', 'gender': 1.0},...   \n",
       "12153  [{'name': 'Michael J Fox', 'gender': 2.0}, {'n...   \n",
       "\n",
       "                                             directors  \\\n",
       "0          [{'name': 'Aki Kaurismaki', 'gender': 0.0}]   \n",
       "1          [{'name': 'Aki Kaurismaki', 'gender': 0.0}]   \n",
       "2          [{'name': 'Andrew Stanton', 'gender': 2.0}]   \n",
       "3         [{'name': 'Robert Zemeckis', 'gender': 2.0}]   \n",
       "4              [{'name': 'Sam Mendes', 'gender': 2.0}]   \n",
       "...                                                ...   \n",
       "12149     [{'name': 'Lucian Pintilie', 'gender': 2.0}]   \n",
       "12150    [{'name': 'William A Seiter', 'gender': 2.0}]   \n",
       "12151      [{'name': 'Michael Curtiz', 'gender': 0.0}]   \n",
       "12152  [{'name': 'Richard C Sarafian', 'gender': 0.0}]   \n",
       "12153     [{'name': 'Robert Zemeckis', 'gender': 2.0}]   \n",
       "\n",
       "                                       companies  \\\n",
       "0      [{'name': 'Villealfa Filmproduction Oy'}]   \n",
       "1      [{'name': 'Villealfa Filmproduction Oy'}]   \n",
       "2          [{'name': 'Pixar Animation Studios'}]   \n",
       "3               [{'name': 'Paramount Pictures'}]   \n",
       "4                   [{'name': 'DreamWorks SKG'}]   \n",
       "...                                          ...   \n",
       "12149                  [{'name': 'Centar Film'}]   \n",
       "12150      [{'name': 'First National Pictures'}]   \n",
       "12151                 [{'name': 'Warner Bros.'}]   \n",
       "12152                         [{'name': 'none'}]   \n",
       "12153           [{'name': 'Universal Pictures'}]   \n",
       "\n",
       "                                              awards_won  \\\n",
       "0                                                     []   \n",
       "1                                                     []   \n",
       "2                                                     []   \n",
       "3      [{'award_id': 66}, {'award_id': 160}, {'award_...   \n",
       "4      [{'award_id': 71}, {'award_id': 165}, {'award_...   \n",
       "...                                                  ...   \n",
       "12149                                                 []   \n",
       "12150                                                 []   \n",
       "12151                                                 []   \n",
       "12152                                                 []   \n",
       "12153                                                 []   \n",
       "\n",
       "                                        awards_nominated             topics  \n",
       "0                                                     []  [{'topic_id': 4}]  \n",
       "1                                                     []  [{'topic_id': 4}]  \n",
       "2                                                     []  [{'topic_id': 7}]  \n",
       "3                                   [{'award_id': 1498}]  [{'topic_id': 8}]  \n",
       "4      [{'award_id': 259}, {'award_id': 1523}, {'awar...  [{'topic_id': 2}]  \n",
       "...                                                  ...                ...  \n",
       "12149                                                 []                 []  \n",
       "12150                                                 []                 []  \n",
       "12151                                                 []                 []  \n",
       "12152                                                 []                 []  \n",
       "12153                                                 []                 []  \n",
       "\n",
       "[12154 rows x 17 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dfs['movies']"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f558b831-44ec-4fef-8f53-8c490f28868f",
   "metadata": {},
   "source": [
    "## ADD KEYWORDS NODE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "cfe3e1dd-f05f-4a8e-8dc1-b9889af6b3c2",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph4j = GraphNeo4j(**{**settings['neo4j'], 'clear_data': False})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "82bbfbfe-f8b2-4652-b223-61a2f9fccf06",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MATCH (t:Topic)<-[]-(m:Movie) UNWIND(t.topics) as keyword\n",
      "    MERGE (k:Keyword {keyword: keyword})\n",
      "    MERGE (k)<-[:HAS_KEYWORD]-(m)\n"
     ]
    }
   ],
   "source": [
    "qry = '''\n",
    "    MATCH (t:Topic)<-[]-(m:Movie) UNWIND(t.topics) as keyword\n",
    "    MERGE (k:Keyword {keyword: keyword})\n",
    "    MERGE (k)<-[:HAS_KEYWORD]-(m)\n",
    "'''\n",
    "graph4j.run_query(qry, {})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "22922d56-2227-417d-8653-a482f7d6302b",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
